OpenFOAM-v2506/tutorials/incompressible/adjointOptimisationFoam/sensitivityMaps/motorBike/system/finite-area/faSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default            steadyState;
}

gradSchemes
{
    default            Gauss linear;
}

divSchemes
{
    default            Gauss linear;
}

laplacianSchemes
{
    default            Gauss linear limited 0.333;
}

interpolationSchemes
{
    default            linear;
}

lnGradSchemes
{
    default            limited 0.333;
}

// ************************************************************************* //
